<!-- dflook/terraform-github-actions {"workspace":"cloud-json-plan-2","backend":"0d6bf8ebb4d5b237b5d413b08b74ed17d93c03ca9d64c5c43166ab7ecbe745d4","backend_type":"remote"} -->
Terraform plan in __tests/workflows/test-cloud/0.13__ in the __cloud-json-plan-2__ workspace
With var files: `tests/workflows/test-cloud/0.13/my_variable.tfvars
`
With variables: `from_variables="from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test Terraform cloud #19](https://github.com/dflook/terraform-github-actions/actions/runs/2282000216)